import java.util.HashMap;

public class Main {
    public static void main(String[] args) {

        String text = "24 юхпзкиек 1969 т. юэеэк жогхеаэуо йевнхрёеф, югкжоппфх ю\n" +
                "еозэдэмонэхы рвтвгвео в пхеоюйевюзеопхпээ крхепвтв веёъэк (рпкв). юйёюзк\n" +
                "ивухх 22 ухз, 18 щок 1992 т. рук юэеээ гюзёйэув г юэуё ювтуоахпэх в\n" +
                "гюхвибхщуяшэц тоеопзэкц щотозь. г 1976 т. ифуо вюпвгопо юэеэыюмок\n" +
                "мвщэююэк йв озвщпвы ьпхетээ (юмоь), врпвы эж нхухы мвзвевы ифув\n" +
                "эжёсхпэх гвжщвъпвюзэ юзевэзхучюзго по зхееэзвеээ юзеопф озвщпвы\n" +
                "ьухмзевюзопнээ (оью). г посоух 1980-ц тт. юэеэыюмок юзвевпо йевгврэуо\n" +
                "йхехтвгвеф ю деопнэхы в юзевэзхучюзгх ахюзэ ьпхетвиувмвг щвшпвюзчя 600\n" +
                "щгз моърфы. йуопэевгоувюч, сзв йхегфы ехомзве иёрхз жойёшхп г 1991 т.\n" +
                "врпомв юрхумо зом э пх ифуо жогхеахпо.пхвицврэщвюзч ювжропэк\n" +
                "понэвпоучпвы иожф рук йвртвзвгмэ юйхнэоуэюзвг г виуоюзэ озвщпвы\n" +
                "ьпхетхзэмэ жоюзогэуо юмоь жопкзчюк йвэюмвщ юзеопф, мвзвеок йвюзогэуо\n" +
                "иф эююухрвгозхучюмэы ехомзве г юэеэя. г 1991 т. г мэзох йеэ юврхыюзгээ\n" +
                "щотозь ифу йеэвиехзхп щэпэозяепфы эюзвспэм пхызевпвг щвшпвюзчя 30 мгз,\n" +
                "мвзвефы ю 1998 т. йеэщхпкхзюк рук йевэжгврюзго юзоиэучпфц эжвзвйвг,\n" +
                "эюйвучжёяшэцюк г щхрэнэпх, о зомъх рук эжёсхпэк пхызевппфц\n" +
                "цоеомзхеэюзэм. йоеоуухучпв юмоь йевгврэуэюч йхехтвгвеф ю оетхпзэпвы в\n" +
                "йвмёймх ухтмвгврпвтв эююухрвгозхучюмвтв ехомзвео щвшпвюзчя 10 щгз.\n" +
                "врпомв йвр рогухпэхщ юв юзвевпф юао э эжеоэук юрхумо зом э пх\n" +
                "ювюзвкуоюч. г 1995–1999 тт. евююэхы э юэеэхы виюёъроуюк гвйевю\n" +
                "юзевэзхучюзго г йвюухрпхы поёспв-эююухрвгозхучюмвтв нхпзео ю\n" +
                "ухтмвгврпфщ крхепфщ ехомзвевщ щвшпвюзчя 25 щгз, о зомъх оью. врпомв йв\n" +
                "еожпфщ йеэсэпощ йеомзэсхюмвтв еожгэзэк ьзэ виюёърхпэк пх йвуёсэуэ.\n";
//        HashMap<Character, Character> map = new HashMap<>();
//        map.put('а', 'м');
//        map.put('б', 'н');
//        map.put('в', 'о');
//        map.put('г', 'п');
//        map.put('д', 'р');
//        map.put('е', 'с');
//        map.put('ё', 'т');
//        map.put('ж', 'у');
//        map.put('з', 'й');
//        map.put('и', 'ю');
//        map.put('й', 'ц');
//        map.put('к', 'ч');
//        map.put('л', 'ш');
//        map.put('м', 'в');
//        map.put('н', 'г');
//        map.put('о', 'ы');
//        map.put('п', 'ь');
//        map.put('р', 'в');
//        map.put('с', 'ю');
//        map.put('т', 'я');
//        map.put('у', 'а');
//        map.put('ф', 'б');
//        map.put('х', 'в');
//        map.put('ц', 'г');
//        map.put('ч', 'д');
//        map.put('ш', 'е');
//        map.put('щ', 'о');
//        map.put('ъ', 'ж');
//        map.put('ы', 'з');
//        map.put('ь', 'и');
//        map.put('э', 'й');
//        map.put('ю', 'к');
//        map.put('я', 'л');

        HashMap<Character, Float> map = new HashMap<>();
        map.put('а', 0.0804F);
        map.put('б', 0.0138F);
        map.put('в', 0.0406F);
        map.put('г', 0.0235F);
        map.put('д', 0.0284F);
        map.put('е', 0.0706F);
        map.put('ё', 0.0001F);
        map.put('ж', 0.0057F);
        map.put('з', 0.0146F);
        map.put('и', 0.0818F);
        map.put('й', 0.0187F);
        map.put('к', 0.0349F);
        map.put('л', 0.0430F);
        map.put('м', 0.0219F);
        map.put('н', 0.0609F);
        map.put('о', 0.1028F);
        map.put('п', 0.0260F);
        map.put('р', 0.0601F);
        map.put('с', 0.0737F);
        map.put('т', 0.0656F);
        map.put('у', 0.0122F);
        map.put('ф', 0.0016F);
        map.put('х', 0.0065F);
        map.put('ц', 0.0073F);
        map.put('ч', 0.0073F);
        map.put('ш', 0.0041F);
        map.put('щ', 0.0057F);
        map.put('ъ', 0.0008F);
        map.put('ы', 0.0179F);
        map.put('ь', 0.0154F);
        map.put('э', 0.0097F);
        map.put('ю', 0.0065F);
        map.put('я', 0.0252F);
        Lab2Easy lab2Easy = new Lab2Easy();
        Lab2Hard lab2Hard = new Lab2Hard();

        //lab2Easy.enumerationByCezar(text);
        //lab2Easy.partialSubstitutionCipher(text, map);
        lab2Hard.frequencyAnalysis(text, map);
    }
}